garyPenhook/PIC-Assembler/Microchip.PIC12-16F1xxx_DFP.1.8.254.atpack_FILES/edc/PIC16F1578.PIC
        <edc:SFRDef edc:access="nnnn----" edc:cname="IOCBP" edc:desc="Interrupt-On-Change Positive Edge Register" edc:impl="0xf0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000----" edc:name="IOCBP" edc:nzwidth="0x8" edc:por="0000----" edc:_addr="0x394">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="IOCBP4" edc:desc="" edc:mask="0x1" edc:name="IOCBP4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IOCBP5" edc:desc="" edc:mask="0x1" edc:name="IOCBP5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IOCBP6" edc:desc="" edc:mask="0x1" edc:name="IOCBP6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IOCBP7" edc:desc="" edc:mask="0x1" edc:name="IOCBP7" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="4"/>
              <edc:SFRFieldDef edc:cname="IOCBP" edc:desc="" edc:mask="0xf" edc:name="IOCBP" edc:nzwidth="4"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnn----" edc:cname="IOCBN" edc:desc="Interrupt-On-Change Negative Edge Register" edc:impl="0xf0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000----" edc:name="IOCBN" edc:nzwidth="0x8" edc:por="0000----" edc:_addr="0x395">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="IOCBN4" edc:desc="" edc:mask="0x1" edc:name="IOCBN4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IOCBN5" edc:desc="" edc:mask="0x1" edc:name="IOCBN5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IOCBN6" edc:desc="" edc:mask="0x1" edc:name="IOCBN6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IOCBN7" edc:desc="" edc:mask="0x1" edc:name="IOCBN7" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="4"/>
              <edc:SFRFieldDef edc:cname="IOCBN" edc:desc="" edc:mask="0xf" edc:name="IOCBN" edc:nzwidth="4"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnn----" edc:cname="IOCBF" edc:desc="Interrupt-On-Change Flag Register" edc:impl="0xf0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000----" edc:name="IOCBF" edc:nzwidth="0x8" edc:por="0000----" edc:_addr="0x396">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="IOCBF4" edc:desc="" edc:mask="0x1" edc:name="IOCBF4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IOCBF5" edc:desc="" edc:mask="0x1" edc:name="IOCBF5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IOCBF6" edc:desc="" edc:mask="0x1" edc:name="IOCBF6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IOCBF7" edc:desc="" edc:mask="0x1" edc:name="IOCBF7" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="4"/>
              <edc:SFRFieldDef edc:cname="IOCBF" edc:desc="" edc:mask="0xf" edc:name="IOCBF" edc:nzwidth="4"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="IOCCP" edc:desc="Interrupt-On-Change Positive Edge Register" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="IOCCP" edc:nzwidth="0x8" edc:por="00000000" edc:_addr="0x397">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="IOCCP0" edc:desc="" edc:mask="0x1" edc:name="IOCCP0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IOCCP1" edc:desc="" edc:mask="0x1" edc:name="IOCCP1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IOCCP2" edc:desc="" edc:mask="0x1" edc:name="IOCCP2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IOCCP3" edc:desc="" edc:mask="0x1" edc:name="IOCCP3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IOCCP4" edc:desc="" edc:mask="0x1" edc:name="IOCCP4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IOCCP5" edc:desc="" edc:mask="0x1" edc:name="IOCCP5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IOCCP6" edc:desc="" edc:mask="0x1" edc:name="IOCCP6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IOCCP7" edc:desc="" edc:mask="0x1" edc:name="IOCCP7" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="IOCCP" edc:desc="" edc:mask="0xff" edc:name="IOCCP" edc:nzwidth="8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="IOCCN" edc:desc="Interrupt-On-Change Negative Edge Register" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="IOCCN" edc:nzwidth="0x8" edc:por="00000000" edc:_addr="0x398">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="IOCCN0" edc:desc="" edc:mask="0x1" edc:name="IOCCN0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IOCCN1" edc:desc="" edc:mask="0x1" edc:name="IOCCN1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IOCCN2" edc:desc="" edc:mask="0x1" edc:name="IOCCN2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IOCCN3" edc:desc="" edc:mask="0x1" edc:name="IOCCN3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IOCCN4" edc:desc="" edc:mask="0x1" edc:name="IOCCN4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IOCCN5" edc:desc="" edc:mask="0x1" edc:name="IOCCN5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IOCCN6" edc:desc="" edc:mask="0x1" edc:name="IOCCN6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IOCCN7" edc:desc="" edc:mask="0x1" edc:name="IOCCN7" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="IOCCN" edc:desc="" edc:mask="0xff" edc:name="IOCCN" edc:nzwidth="8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
