garyPenhook/PIC-Assembler/Microchip.PIC12-16F1xxx_DFP.1.8.254.atpack_FILES/edc/PIC16F1578.PIC
        <edc:SFRDef edc:access="---nnnnn" edc:cname="T1GPPS" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu" edc:name="T1GPPS" edc:nzwidth="8" edc:por="---00100" edc:_addr="0xE13">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="T1GPPS" edc:desc="" edc:mask="0x1f" edc:name="T1GPPS" edc:nzwidth="5"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="T1GPPS0" edc:desc="" edc:mask="0x1" edc:name="T1GPPS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T1GPPS1" edc:desc="" edc:mask="0x1" edc:name="T1GPPS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T1GPPS2" edc:desc="" edc:mask="0x1" edc:name="T1GPPS2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T1GPPS3" edc:desc="" edc:mask="0x1" edc:name="T1GPPS3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T1GPPS4" edc:desc="" edc:mask="0x1" edc:name="T1GPPS4" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="CWG1INPPS" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu" edc:name="CWG1INPPS" edc:nzwidth="8" edc:por="---00010" edc:_addr="0xE14">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CWG1INPPS" edc:desc="" edc:mask="0x1f" edc:name="CWG1INPPS" edc:nzwidth="5"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="CWG1INPPS0" edc:desc="" edc:mask="0x1" edc:name="CWG1INPPS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CWG1INPPS1" edc:desc="" edc:mask="0x1" edc:name="CWG1INPPS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CWG1INPPS2" edc:desc="" edc:mask="0x1" edc:name="CWG1INPPS2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CWG1INPPS3" edc:desc="" edc:mask="0x1" edc:name="CWG1INPPS3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CWG1INPPS4" edc:desc="" edc:mask="0x1" edc:name="CWG1INPPS4" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="RXPPS" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu" edc:name="RXPPS" edc:nzwidth="8" edc:por="---10101" edc:_addr="0xE15">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RXPPS" edc:desc="" edc:mask="0x1f" edc:name="RXPPS" edc:nzwidth="5"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="RXPPS0" edc:desc="" edc:mask="0x1" edc:name="RXPPS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXPPS1" edc:desc="" edc:mask="0x1" edc:name="RXPPS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXPPS2" edc:desc="" edc:mask="0x1" edc:name="RXPPS2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXPPS3" edc:desc="" edc:mask="0x1" edc:name="RXPPS3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXPPS4" edc:desc="" edc:mask="0x1" edc:name="RXPPS4" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="CKPPS" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu" edc:name="CKPPS" edc:nzwidth="8" edc:por="---10100" edc:_addr="0xE16">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CKPPS" edc:desc="" edc:mask="0x1f" edc:name="CKPPS" edc:nzwidth="5"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="CKPPS0" edc:desc="" edc:mask="0x1" edc:name="CKPPS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CKPPS1" edc:desc="" edc:mask="0x1" edc:name="CKPPS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CKPPS2" edc:desc="" edc:mask="0x1" edc:name="CKPPS2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CKPPS3" edc:desc="" edc:mask="0x1" edc:name="CKPPS3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CKPPS4" edc:desc="" edc:mask="0x1" edc:name="CKPPS4" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="ADCACTPPS" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu" edc:name="ADCACTPPS" edc:nzwidth="8" edc:por="---10100" edc:_addr="0xE17">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ADCACTPPS" edc:desc="" edc:mask="0x1f" edc:name="ADCACTPPS" edc:nzwidth="5"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="ADCACTPPS0" edc:desc="" edc:mask="0x1" edc:name="ADCACTPPS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADCACTPPS1" edc:desc="" edc:mask="0x1" edc:name="ADCACTPPS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADCACTPPS2" edc:desc="" edc:mask="0x1" edc:name="ADCACTPPS2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADCACTPPS3" edc:desc="" edc:mask="0x1" edc:name="ADCACTPPS3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADCACTPPS4" edc:desc="" edc:mask="0x1" edc:name="ADCACTPPS4" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="29" edc:beginaddr="0xe80" edc:endaddr="0xef0" edc:regionid="sfr29">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0" edc:_addr="0xE80"/>
        <edc:AdjustPoint edc:offset="4" edc:_addr="0xE8C"/>
        <edc:SFRDef edc:access="----nnnn" edc:cname="RA0PPS" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----uuuu" edc:name="RA0PPS" edc:nzwidth="8" edc:por="----0000" edc:_addr="0xE90">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RA0PPS" edc:desc="" edc:mask="0xf" edc:name="RA0PPS" edc:nzwidth="4"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="RA0PPS0" edc:desc="" edc:mask="0x1" edc:name="RA0PPS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RA0PPS1" edc:desc="" edc:mask="0x1" edc:name="RA0PPS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RA0PPS2" edc:desc="" edc:mask="0x1" edc:name="RA0PPS2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RA0PPS3" edc:desc="" edc:mask="0x1" edc:name="RA0PPS3" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="----nnnn" edc:cname="RA1PPS" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----uuuu" edc:name="RA1PPS" edc:nzwidth="8" edc:por="----0000" edc:_addr="0xE91">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RA1PPS" edc:desc="" edc:mask="0xf" edc:name="RA1PPS" edc:nzwidth="4"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="RA1PPS0" edc:desc="" edc:mask="0x1" edc:name="RA1PPS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RA1PPS1" edc:desc="" edc:mask="0x1" edc:name="RA1PPS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RA1PPS2" edc:desc="" edc:mask="0x1" edc:name="RA1PPS2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RA1PPS3" edc:desc="" edc:mask="0x1" edc:name="RA1PPS3" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="----nnnn" edc:cname="RA2PPS" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----uuuu" edc:name="RA2PPS" edc:nzwidth="8" edc:por="----0000" edc:_addr="0xE92">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RA2PPS" edc:desc="" edc:mask="0xf" edc:name="RA2PPS" edc:nzwidth="4"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="RA2PPS0" edc:desc="" edc:mask="0x1" edc:name="RA2PPS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RA2PPS1" edc:desc="" edc:mask="0x1" edc:name="RA2PPS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RA2PPS2" edc:desc="" edc:mask="0x1" edc:name="RA2PPS2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RA2PPS3" edc:desc="" edc:mask="0x1" edc:name="RA2PPS3" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="1" edc:_addr="0xE93"/>
        <edc:SFRDef edc:access="----nnnn" edc:cname="RA4PPS" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----uuuu" edc:name="RA4PPS" edc:nzwidth="8" edc:por="----0000" edc:_addr="0xE94">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RA4PPS" edc:desc="" edc:mask="0xf" edc:name="RA4PPS" edc:nzwidth="4"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="RA4PPS0" edc:desc="" edc:mask="0x1" edc:name="RA4PPS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RA4PPS1" edc:desc="" edc:mask="0x1" edc:name="RA4PPS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RA4PPS2" edc:desc="" edc:mask="0x1" edc:name="RA4PPS2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RA4PPS3" edc:desc="" edc:mask="0x1" edc:name="RA4PPS3" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="----nnnn" edc:cname="RA5PPS" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----uuuu" edc:name="RA5PPS" edc:nzwidth="8" edc:por="----0000" edc:_addr="0xE95">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RA5PPS" edc:desc="" edc:mask="0xf" edc:name="RA5PPS" edc:nzwidth="4"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="RA5PPS0" edc:desc="" edc:mask="0x1" edc:name="RA5PPS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RA5PPS1" edc:desc="" edc:mask="0x1" edc:name="RA5PPS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RA5PPS2" edc:desc="" edc:mask="0x1" edc:name="RA5PPS2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RA5PPS3" edc:desc="" edc:mask="0x1" edc:name="RA5PPS3" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="6" edc:_addr="0xE96"/>
        <edc:SFRDef edc:access="----nnnn" edc:cname="RB4PPS" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----uuuu" edc:name="RB4PPS" edc:nzwidth="8" edc:por="----0000" edc:_addr="0xE9C">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RB4PPS" edc:desc="" edc:mask="0xf" edc:name="RB4PPS" edc:nzwidth="4"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="RB4PPS0" edc:desc="" edc:mask="0x1" edc:name="RB4PPS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RB4PPS1" edc:desc="" edc:mask="0x1" edc:name="RB4PPS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RB4PPS2" edc:desc="" edc:mask="0x1" edc:name="RB4PPS2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RB4PPS3" edc:desc="" edc:mask="0x1" edc:name="RB4PPS3" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
